sites/static/localhost/doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Wemebox Documentation</title>
<!-- 2019-05-09 Thu 12:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="devasia" />
<link rel="stylesheet" type="text/css" href="/static/css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Wemebox Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Getting started</a></li>
<li><a href="#sec-2">2. Adding Pages</a></li>
<li><a href="#sec-3">3. Base Pages</a></li>
<li><a href="#sec-4">4. Static Pages</a></li>
<li><a href="#sec-5">5. Template Pages</a></li>
<li><a href="#sec-6">6. Markdown pages</a></li>
<li><a href="#sec-7">7. Dynamic pages</a></li>
<li><a href="#sec-8">8. Raw Pages</a></li>
<li><a href="#sec-9">9. Standalone Pages</a></li>
<li><a href="#sec-10">10. Image Files</a></li>
<li><a href="#sec-11">11. CSS editor</a></li>
<li><a href="#sec-12">12. Javascript editor</a></li>
<li><a href="#sec-13">13. Config</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Download the the zip file from <a href="http://www.wemebox.com/r/downloads.html">http://www.wemebox.com/r/downloads.html</a> for your Operating System. It has binaries for linux, windows, and mac (32 bit and 64 bit)
</li>
<li>Extract the file and open the directory
</li>
<li>Once you run your binary open <a href="http://127.0.0.1:8080">http://127.0.0.1:8080</a>  for home page and <a href="http://127.0.0.1:8080/admin">http://127.0.0.1:8080/admin</a> for admin page 
</li>
<li>Default login credentials will be <b>username:</b> admin <b>password:</b> root123
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Adding Pages</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Pages can be modified under Pages menu item from admin area or directly from html/ directory
</li>
<li>Static files such as css,javascript,images,videos must be added to <b>/static</b> directory
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Base Pages</h2>
<div class="outline-text-2" id="text-3">
<p>
Base pages are the templates for static pages. Base pages must have template blocks in place to add content from your static page like given below
</p>
<pre class="example">
{{block "block-name" .}} {{end}}
</pre>
<p>
You can use your own block names or just use the default block names generated automatically like given below
</p>

<pre class="example">
{{block "content" .}}{{end}}
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Static Pages</h2>
<div class="outline-text-2" id="text-4">
<p>
Static pages inherit a <b>base page</b>. Contents in the static pages template blocks appear in 
</p>

<pre class="example">
{{define "content"}}{{end}}
</pre>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Template Pages</h2>
<div class="outline-text-2" id="text-5">
<p>
Template pages are templates for Markdown and Dynamic pages. Template pages inherit their layout from a <b>Base Page</b> like static page.
Template page will have the following tags.  <b>.HtmlContent</b> tag will contain the converted html content from the markdown or dynamic page input
</p>

<pre class="example">
 {{define "title"}}{{.Title}}{{end}}
{{define "content"}}
    {{.HtmlContent}}
{{end}}
</pre>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Markdown pages</h2>
<div class="outline-text-2" id="text-6">
<p>
Markdown pages are for markdown content. More information on markdown format can be found here: <a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a>
</p>

<ol class="org-ol">
<li><b>Title</b> can be used to specify the page title.
</li>
<li><b>Url Slug</b> is for <b>SEO</b>.It is the unique url for the markdown page. It can be autogenerated from title or it can be any unique SEO friendly title
</li>
<li><b>Base File</b> is the base page layout
</li>
<li><b>Template file</b> is the template page for the markdown content
</li>
<li>The markdown editor can be used to enter the markdown content and click preview to view how the content will look like.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Dynamic pages</h2>
<div class="outline-text-2" id="text-7">
<p>
Dynamic pages can be used to create web pages just like a text editor.
</p>

<ol class="org-ol">
<li><b>Title</b> can be used to specify the page title.
</li>
<li><b>Url Slug</b> is for <b>SEO</b>.It is the unique url for the markdown page. It can be autogenerated from title or it can be any unique SEO friendly title
</li>
<li><b>Base File</b> is the base page layout
</li>
<li><b>Template file</b> is the template page for the markdown content
</li>
<li>The text editor is used to enter the content that is needed for the page
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Raw Pages</h2>
<div class="outline-text-2" id="text-8">
<p>
Sometimes you might want to create html pages wuth your favorite website creator application.
You create the raw page with static page format and point the url to <b>/r/filename.html</b>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Standalone Pages</h2>
<div class="outline-text-2" id="text-9">
<p>
If you want to create a standlone page, which is pure html file, just create the html file and point the url to <b>/sp/filename.html</b>
</p>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Image Files</h2>
<div class="outline-text-2" id="text-10">
<p>
Image files can be added by clicking on the <b>Files</b> and then <b>Add Images</b>
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> CSS editor</h2>
<div class="outline-text-2" id="text-11">
<p>
You can edit javascript files from <b>Files</b> -&gt; <b>CSS</b>. Enter the file path to edit or create a new file.
All files are <b>saved in static directory</b>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Javascript editor</h2>
<div class="outline-text-2" id="text-12">
<p>
You can edit javascript files from <b>Files</b> -&gt; <b>Javascript</b>. Enter the file path to edit or create a new file.
All files are <b>saved in static directory</b>
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Config</h2>
<div class="outline-text-2" id="text-13">
<p>
Website configurations can be found in config.yml file.
</p>

<ul class="org-ul">
<li><b>port:</b> 8080 (default port is 8080 for development. If you set ssl true, the webserver will be started at port 443)
</li>

<li><b>ssl</b>: false (For development set this to false. When this is set to true, the application will automatically setup ssl certificate for you)
</li>

<li><b>compress</b>: true (Static files will be compressed by default for faster downloads)   <b>Note:</b> If you are using your own webserver like nginx, just set this to false
</li>

<li><b>dev</b>: This config setting is set to true while you are developing on your Desktop computer. Set this to true while deploying
</li>

<li><b>domain</b>: Set this value if you are using "https" in production. Use top level domain name E.G:mydomain.com
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: devasia</p>
<p class="date">Created: 2019-05-09 Thu 12:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
